# This dictionary should contain at least one example for each meter, which will be used as few-shot to calculate loss.
# Most examples lifted from https://dirk-johnson.com/aptes-metrical-appendix-to-the-practical-sanskrit-english-dictionary/

meter_examples = {
    "Praharṣiṇī" : "निर्दिष्टाङ् कुलपतिना स पर्णशालाम् अध्यास्य प्रयतपरिग्रहद्वितीयः ।\nतच्छिष्याध्ययननिवेदितावसानां सव्ँविष्टः कुशशयने निशान् निनाय ॥",
    'Anuṣṭubh (Śloka)': 'वागर्थाविव संपृक्तौ वागर्थप्रतिपत्तये ।\n'
                     'जगतः पितरौ वंदे पार्वतीपरमेश्वरौ ॥',
 'asambādhā': 'वीर्याग्नौ येन ज्वलति रणवशात्क्षिप्ते\n'
              'दैत्येंद्रे जाता धरणिरियमसंबाधा ।\n'
              'धर्मस्थित्यर्थं प्रकटिततनुसंबंधः\n'
              'साधूनां बाधां प्रशमयतु स कंसारिः ॥',
 'bhujagaśiśubhṛtā': 'ह्रदतटनिकटक्षौणी भुजगशिशुभृता याऽसीत् ।\n'
                     'मुररिपुदलिते नागे व्रजजनसुखदा सा ऽभूत् ॥',
 'bhujaṅgaprayāta': 'धनैर्निष्कुलीनाः कुलीना भवंति\n'
                    'धनैरापदं मानवा निस्तरंति ।\n'
                    'धनेभ्यः परो बांधवो नास्ति लोके\n'
                    'धनान्यर्जयध्वं धनान्यर्जयध्वम् ॥',
 'bhujaṅgasaṅgatā': 'तरला तरंगिरिंगितैर्यमुना भुजंगसंगता ।\n'
                    'कथमेति वत्सचारकश्चपलः सदैव तां हरिः ॥',
 'candravartma': 'चंद्रवर्त्म विहितं घनतिमिरैः\n'
                 'राजवर्त्म रहितं जनगमनैः ।\n'
                 'इष्टवर्त्म तदलंकुरु सरसे\n'
                 'कुंजवर्त्मनि हरिस्तव कुतुकी ॥',
 'citra': 'विद्रुमारुणाधरौष्ठशोभिवेणुवाद्यहृष्ट-\n'
          'वल्लवीजनांगसंगजातमुग्घकंठकांग |\n'
          'त्वां सदैव वासुदेव पुण्यलभ्यपाद देव\n'
          'वण्यपुष्पचित्रकेश संस्मरामि गोपवेश ॥',
 'drutavilaṃbita': 'मुनिसुताप्रणयस्मृतिरोधिना\n'
                   'मम च मुक्तमिदं तमसा मनः ।\n'
                   'मनसिजेन सखे प्रहरिष्यता\n'
                   'धनुषि चूतशरश्च निवेशितः ॥',
 'gajagatī': 'रविसुतापरिसरे विहरतो दृशि हरेः ।\nव्रजवधूगजगतिर्मुदमलं व्यतनुत ॥',
 'gītikā': 'करतालचंचलकंकणस्वनमिश्रणेन मनोरमा\n'
           'रमणीयवेणुनिनादरंगिमसंगमेन सुखावहा ।\n'
           'बहलानुरागनिवासराससमुद्भवा तव रागिणं\n'
           'विदधौ हरिं खलु वल्लवीजनचारुचामरगीतिका ॥',
 'iṃdravajrā': 'गोष्ठे गिरिं सव्यकरेण धृत्वा\n'
               'रुष्टेंद्रवज्राहतिमुक्तवृष्टौ |\n'
               'यो गोकुलं गोपकुलं च सुस्थं\n'
               'चक्रे स नो रक्षतु चक्रपाणिः ॥',
 'iṃdravaṃśā': 'दैत्येंद्रवंशाग्निरुदीर्णदीधितिः\n'
               'पीतांबरोऽसौ जगतां तमोपहः ।\n'
               'यस्मिन्ममज्जुः शलभा इव स्वयं\n'
               'ते कंसचाणूरमुखा मखद्विषः॥',
 'jaladharāmālā': 'या भक्तानां कलिदुरितोत्तप्तानां\n'
                  'तापच्छेदे जलधरमाला नव्या ।\n'
                  'भव्याकारा दिनकरपुत्रीकूले\n'
                  'केलीलोला हरितनुरव्यात्सा वः ॥',
 'jaloddhatagati': 'समीरशिशिरः शिरस्सु वसतां\n'
                   'सतां जवनिका निकामसुखिनाम् ।\n'
                   'बिभर्ति जनयन्नयं मुदमपा\n'
                   'मपायधवला बलाहकततीः ॥',
 'kanyā': 'भास्वत्कन्या सैका धन्या यस्याः कूले कृष्णोऽखेलत् ॥',
 'kumāralalitā': 'मुरारितनुवल्ली कुमारललिता सा ।\n'
                 'व्रजैणनयनानां ततान मुदमुच्वैः ॥',
 'leelākhela': 'मा कांते पक्षस्यांते पर्याकाशे देशे स्वाप्सीः\n'
               'कांतं वक्त्रं वृत्तं पूर्णं चंद्रं मत्वा रात्रौ चेत् ।\n'
               'क्षुत्क्षामः प्राटंश्चेतश्चेतो राहुः क्रूरः प्राद्यात्\n'
               'तस्माद् ध्वांते हर्म्यस्यांते शय्यैकांते कर्तव्या ॥',
 'madalekhā': 'रंगे बाहुविरुग्णाद् दंतींद्रान्मदलेखा ।\n'
              'लग्नाभून्पुरशत्रौ कस्तूरीरसचर्चा ॥',
 'madhumatī': 'रविदुहितृतटे वनकुसुमततिः ।\nव्यधित मधुमती मधुमथनमुदम् ॥',
 'manjubhāṣiṇī': 'यमुनामतीतमथ शुश्रुवानमुं\n'
                 'तपसस्तनूज इति नाधुनोच्यते ।\n'
                 'स यदाऽचलन्निजपुरादहर्निशं\n'
                 'नृपतेस्तदादि समचारि वार्तया ॥',
 'mattamayūrī': 'दृष्ट्वा दृश्यान्याचरणीयानि विधाय\n'
                'प्रेक्षाकारी याति यदं मुक्तमपायैः ।\n'
                'सम्यग्दृष्टिस्तस्य परं पश्यति यस्त्वां\n'
                'यश्चोपास्ते साधु विधेयं स विधत्ते ॥',
 'mattā': 'पीत्वा मत्ता मधु मधुपाली ।\n'
          'कालिंदीये तटवनकुंजे ॥\n'
          'उद्दीव्यंतीर्व्रजजनरामाः\n'
          'कामासक्ता मधुजिति चक्रे ॥',
 'meghavisphūrjitā': 'कदंबामोदाढ्या विपिनपवनः केकिनः कांतकेकाः\n'
                     'विनिद्राः कंदल्यो दिशि दिशि मुदा दर्दुरा दृप्तनादाः ।\n'
                     'निशा नृत्यद्विद्युद्विलसितलसन्मेघविस्फूर्जिता चेत्\n'
                     'प्रियः स्वाधीनोऽसौ दनुजदलनो राज्यमस्मात्किमन्यत् ॥',
 'mālinī': 'शशिनमुपगतेयं कौमुदी मेघमुक्तं\n'
           'जलनिधिमनुरूपं जह्नुकन्यावतीर्णा ।\n'
           'इति समगुणयोगप्रीतयस्तत्र पौराः\n'
           'श्रवणकटु नृपाणामेकवाक्यं विवव्रुः ॥',
 'nāndana': 'तरणिसुतातरंगपवनैः सलीलमांदोलितं\n'
            'मधुरिपुपादपंकजरजःसुपूतपृथ्वीतलम् ।\n'
            'मुरहरचित्रचेष्टितकलाकलापसंस्मारकं\n'
            'क्षितितलनंदनं व्रज सखे सुखाय वृंदावनम् ॥',
 'pathyā': 'स्थगयंत्यमूः शमितचातकार्तस्वराः\n'
           'जलदास्तडित्तुलितकांतकार्तस्वराः ।\n'
           'जगतीरिह स्फुरितचारुचामीकराः\n'
           'सवितुः क्वचित्कपिशयंति चामी कराः ॥',
 'pañcachāmara': 'सुरद्रुमूलमंडपे विचित्ररत्ननिर्मिते\n'
                 'लसद्वितानभूषिते सलीलविभ्रमालसम् ।\n'
                 'सुरांगनाभवल्लवीकरप्रपंचचामर-\n'
                 'स्फुरत्समीरवीजितं सदाच्युतं भजामि तम् ॥',
 'praharṣiṇī': 'ते रेखाध्वजकुलिशातपत्रचिह्नं\n'
               'सम्राजश्चरणयुगं प्रसादलभ्यम्।\n'
               'प्रस्थानप्रणतिभिरंगुलीषु चक्रु-\n'
               'र्मौलिस्रक्च्युतमकरंदरेणुगौरम् ॥',
 'pramitākṣarā': 'विहगाः कदंबसुरभाविह गाः\n'
                 'कलयंत्यनुक्षणमनेकलयम् ।\n'
                 'भ्रमयन्नपैति मुहुरभ्रमयं\n'
                 'पवनश्च धूतनवनीपवनः ॥',
 'pramāṇikā': 'पुनातु भक्तिरच्युता सदाच्युतांघ्रिपद्मयोः ।\n'
              'श्रुतिस्मृतिप्रमाणिका भवांबुराशितारिका॥',
 'pāṅkti': 'कृष्णसनाथा तर्णकपंक्तिः ।\nयामुनकच्छे चारु चचार ॥',
 'samānikā': 'यस्य कृष्णपादपद्ममस्ति हृत्तडागसद्म ।\n'
             'धीः समानिका परेण नोचितात्र मत्सरेण॥',
 'tanumadhyamā': 'मूर्तिर्मुरशत्रोरत्यद्भुतरूपा ।\n'
                 'आस्तां मम चित्ते नित्यं तनुमध्या ॥',
 'tvaritagati': 'त्वरितगतिर्व्रजयुवतिस्तरणिसुता विपिनगता ।\n'
                'मुररिपुणा रतिगुरुणा परिरमिता प्रमदमिता ॥',
 'vasantatilakā': 'यात्येकतोऽस्तशिखरं पतिरोषधीना-\n'
                  'माविष्कृतारुणपुरःसर एकतो ऽर्कः ।\n'
                  'तेजोद्वयस्य युगपद् व्यसनोदयाभ्यां\n'
                  'लोको नियम्यत इवात्मदशांतरेषु ॥',
 'vidyullekhā': 'श्रीदीप्ती थीकीर्ती धीनीती गीःप्रीती ।\n'
                'एधेते द्वे द्वे ते ये नेमे देवेशे ॥',
 'vidyunmālā': 'वासोवल्ली विद्युन्माला बर्हश्रेणी शाक्रश्चापः ।\n'
               'यस्मिन्नास्तां तापोच्छित्त्यै गोमध्यस्थः कृष्णांभोदः॥',
 'śaśivadanā': 'शशिवदनानां व्रजतरुणीनाम् ।\nअधरसुधोर्मि मधुरिपुरैच्छत् ॥',
 'śikhariṇī': 'दिगंते श्रूयंते मदमलितगंडाः करटिनः\n'
              'करिण्यः कारुण्यास्पदमसमशीलाः खलु मृगाः ।\n'
              'इदानीं लोकेस्मिन्ननुपमशिखानां पुनरयं\n'
              'नखानां पांडित्यं प्रकटयतु कस्मिन् मृगपतिः ॥',
 'śālinī': 'अंघो हंति ज्ञानवृद्धिं विधत्ते\n'
           'धर्मं दत्ते काममर्थं च सूते\n'
           'मुक्तिं दत्ते सर्वदोपास्यमाना\n'
           'पुंसां श्रद्धाशालिनी विष्णुभक्तिः॥',
 'śārdūlavikrīḍita': 'वेदांतेषु यमाहुरेकपुरुषं व्याप्य स्थितं रोदसी\n'
                     'यस्मिन्नीश्वर इत्यनन्यविषयः शब्दो यथार्थाक्षरः ।\n'
                     'अंतर्यश्च मुमुक्षुभिर्नियमितप्राणादिभिर्मृग्यते\n'
                     'स स्थाणुः स्थिरभक्तियोगसुलभो निःश्रेयसायास्तु वः',
 'ṛucirā': 'कदा मुखं वरतनु कारणादृते\n'
           'तवागतं क्षणमपि कोपपात्रताम् ।\n'
           'अपर्वणि ग्रहकलुषेंदुमंडला\n'
           'विभावरी कथय कथं भविष्यति ॥',
    'gajagatiḥ' : """रविसुतापरिसरे विहरतो दृशि हरेः ।
    व्रजवधूगजगतिर्मुदमलं व्यतनुत ॥""",
    'paṅkti' : """कृष्णसनाथा तर्णकपंक्तिः ।
    यामुनकच्छे चारु चचार ॥""",
    'tanumadhyā': """मूर्तिर्मुरशत्रोरत्यद्भुतरूपा । 
    आस्तां मम चित्ते नित्यं तनुमध्या ॥""",
    'Anuṣṭup (Śloka)' : """वागर्थाविव संपृक्तौ वागर्थप्रतिपत्तये । 
    जगतः पितरौ वंदे पार्वतीपरमेश्वरौ ॥""",
}